# Создайте несколько переменных разных типов. Проверьте,
# к какому типу относятся созданные переменные.

a = 5
b = "Hello"
c = 3.14
d = True
e = None

print(a, type(a))
print(b, type(b))
print(c, type(c))
print(d, type(d))
print(e, type(e))
